app/controllers/notes_controller.rb

	def create
		@job.notes.create!(note_params)
---
INSERT INTO "notes" ("content", "job_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Listen to 5th Symphony"], ["job_id", 2], ["created_at", "2017-11-20 18:28:29.197351"], ["updated_at", "2017-11-20 18:28:29.197351"]]

	def update
		@note.update(note_params)
---
UPDATE "notes" SET "content" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["content", "something Else"], ["updated_at", "2017-11-20 18:40:04.613481"], ["id", 2]]

	def set_job_note
		@note = @job.notes.find_by!(id: params[:id]) if @job
---
SELECT  "notes".* FROM "notes" WHERE "notes"."job_id" = ? AND "notes"."id" = ? LIMIT ?  [["job_id", 1], ["id", 2], ["LIMIT", 1]]